# St7GetNumGeometryFaceCavityLoops

Returns the number of cavity loops in the specified geometry face.

long St7GetNumGeometryFaceCavityLoops(long uID, long FaceNum,

long* NumCavityLoops)

Input Parameters

uID

Strand7 model file ID.

FaceNum

Face number.

Output Parameters

NumCavityLoops

Number of cavity loops in the specified face.